[
  {
    "name": "Chicken, Leek and Bacon Pie",
    "ingredients": [
      { "ingredient_id": 1, "amount": 2 },
      { "ingredient_id": 2, "amount": 1 },
      { "ingredient_id": 3, "amount": 160 },
      { "ingredient_id": 4, "amount": 50 },
      { "ingredient_id": 5, "amount": 100 },
      { "ingredient_id": 6, "amount": 15 },
      { "ingredient_id": 7, "amount": 10 },
      { "ingredient_id": 8, "amount": 2 },
      { "ingredient_id": 9, "amount": 3 },
      { "ingredient_id": 10, "amount": 160 },
      { "ingredient_id": 11, "amount": 1 }
    ],
    "instructions": [
      "Preheat the oven to 200°C, take the meat out of the fridge, and boil a kettle.",
      "Put the chicken on a baking tray, and add oil, salt and pepper. Put in the oven for 15mins.",
      "Cut the bacon into pieces. Cut the leek lengthways then finely slice it. Peel and press the garlic.",
      "Cook the bacon in a pan with oil for 5mins. Add the sliced leek and garlic, then cook for 5mins.",
      "Add 100ml boiled water to a measuring jug. Dissolve the stock cubes. Add the soft cheese, wholegrain mustard and Chinese rice wine.",
      "Add the stock from the jug to the pan with the bacon and cook for 5mins.",
      "Once the chicken is cooked, place on a chopping board and pull into shreds using two forks.",
      "Beat an egg with a tablespoon of milk. Roll the pastry on a counter sprinkled with flour, and wash with the egg.",
      "Put the contents of the pan in an oven dish. Cover with pastry and press in the edges to seal. Cook in the oven for 20mins.",
      "When the oven has 5mins left, cook the green beans in a pan of water for 5mins."
    ]
  },
  {
    "name": "Penne & Cheese",
    "ingredients": [
      { "ingredient_id": 12, "amount": 1 },
      { "ingredient_id": 9, "amount": 1 },
      { "ingredient_id": 13, "amount": 60 },
      { "ingredient_id": 14, "amount": 200 },
      { "ingredient_id": 15, "amount": 60 },
      { "ingredient_id": 16, "amount": 25 },
      { "ingredient_id": 8, "amount": 1 },
      { "ingredient_id": 17, "amount": 150 },
      { "ingredient_id": 18, "amount": 200 }
    ],
    "instructions": [
      "Preheat the oven to 200°C and boil a kettle.",
      "Finely slice the shallot. Peel and press the garlic. Grate all the cheese.",
      "Add the pasta to a pan of boiling water and cook for 12mins.",
      "Cook the chorizo in a pan with oil for 2mins. Then put it into a bowl and mix with the breadcrumbs and a tablespoon of olive oil.",
      "Cook the shallot in a pan with oil for 5mins, then stir in 15g of plain flour.",
      "Dissolve the stock cube in 200ml boiling water, then stir into the pan and simmer for 2mins.",
      "Stir in the creme fraiche then remove from the heat.",
      "Add the cheese to the pan and stir until it has melted. Add salt and pepper, then stir in the pasta. Transfer to an overproof dish and cook in the oven for 5mins.",
      "Cook the broccoli in a pan with oil for 2mins. Add salt and pepper, and a splash of water."
    ]
  },
  {
    "name": "Beef Kebab",
    "ingredients": [
      { "ingredient_id": 19, "amount": 1 },
      { "ingredient_id": 20, "amount": 1 },
      { "ingredient_id": 21, "amount": 0.5 },
      { "ingredient_id": 22, "amount": 50 },
      { "ingredient_id": 23, "amount": 20 },
      { "ingredient_id": 24, "amount": 1 },
      { "ingredient_id": 24, "amount": 250 },
      { "ingredient_id": 26, "amount": 3 },
      { "ingredient_id": 9, "amount": 2 },
      { "ingredient_id": 27, "amount": 80 },
      { "ingredient_id": 28, "amount": 2 },
      { "ingredient_id": 29, "amount": 10 }
    ],
    "instructions": [
      "Preheat the oven to 200°C.",
      "Peel the potatoes and cut into chips. Put them on a baking tray and add oil, salt and pepper. Put in the oven for 30mins.",
      "Peel and chop the red onion in half. Finely dice one half, and grate the other half. Peel and press the garlic.",
      "Add the beef mince to a bowl with the grated onion, garam masala, garlic, and salt and pepper.",
      "Wet your hands, then knead the mixture into two sausage shapes.",
      "Cook the kebabs in a pan with oil for 15mins.",
      "Peel the skin off the cucumber. Dice the mint leaves, and mix into the yoghurt with the cucumber skin.",
      "Dice the inner cucumber and tomato. Mix in a bowl with the diced onion and add coriander to make a salad.",
      "Heat the naan bread in the oven for 3mins. Add the kebabs and masala sauce to the warm naan breads."
    ]
  }
]
